In [1]:
import pandas as pd

In [3]:
df=pd.read_csv("output.csv")

In [4]:
df.head()

         Name  Age  Salary      City
0     Prakash   21   40000  Banglore
1      Malaya   20   30000   Bhadrak
2  Subhranshu   22  450000    jajpur
3       Rudra   23   80000   Bhadrak
4    Kaivalya   22   70000    jajpur

In [5]:
df.tail()

       Name  Age  Salary      City
3     Rudra   23   80000   Bhadrak
4  Kaivalya   22   70000    jajpur
5   Ashrita   20   30000  Cuttuack
6   Abhipsa   21  400000  Cuttuack
7   Manohar   22   50000     Bihar

In [6]:
df.shape#(row,col)

(8, 4)

In [7]:
df.columns

Index(['Name', 'Age', 'Salary', 'City'], dtype='object')

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    8 non-null      object
 1   Age     8 non-null      int64
 2   Salary  8 non-null      int64
 3   City    8 non-null      object
dtypes: int64(2), object(2)
memory usage: 388.0+ bytes

In [9]:
df.describe()

            Age         Salary
count   8.00000       8.000000
mean   21.37500  143750.000000
std     1.06066  175005.101966
min    20.00000   30000.000000
25%    20.75000   37500.000000
50%    21.50000   60000.000000
75%    22.00000  160000.000000
max    23.00000  450000.000000